import react1 from "../img/react1.webp";
import react2 from "../img/react2.webp";
import react3 from "../img/react3.webp";
import img1 from "../img/project.webp";

export const projectsList = [
  {
    id: 1,
    img: react1,
    title: "lorem1",
    category: "React",
    description:
      "Полнофункциональная платформа для онлайн-продаж с корзиной, платежами и личным кабинетом",
    technologies: ["React", "Node.js", "MongoDB", "Chart.js"],
    features: [
      "Прогноз на 5 дней с почасовой детализацией",
      "Интерактивные графики температуры",
      "Геолокация для автоматического определения местоположения",
      "Уведомления о резких изменениях погоды",
    ],
    githubLink: "#",
    liveDemoLink: "#",
  },
  {
    id: 2,
    img: img1,
    title: "lorem2",
    category: "JS",
    description:
      "Полнофункциональная платформа для онлайн-продаж с корзиной, платежами и личным кабинетом",
    technologies: ["React", "Node.js", "MongoDB", "Chart.js"],
    features: [
      "Прогноз на 5 дней с почасовой детализацией",
      "Интерактивные графики температуры",
      "Геолокация для автоматического определения местоположения",
      "Уведомления о резких изменениях погоды",
    ],
    githubLink: "#",
    liveDemoLink: "#",
  },
  {
    id: 3,
    img: react2,
    title: "lorem3",
    category: "React",
    description:
      "Полнофункциональная платформа для онлайн-продаж с корзиной, платежами и личным кабинетом",
    technologies: ["React", "Node.js", "MongoDB", "Chart.js"],
    features: [
      "Прогноз на 5 дней с почасовой детализацией",
      "Интерактивные графики температуры",
      "Геолокация для автоматического определения местоположения",
      "Уведомления о резких изменениях погоды",
    ],
    githubLink: "#",
    liveDemoLink: "#",
  },
  {
    id: 4,
    img: img1,
    title: "lorem4",
    category: "JS",
    description:
      "Полнофункциональная платформа для онлайн-продаж с корзиной, платежами и личным кабинетом",
    technologies: ["React", "Node.js", "MongoDB", "Chart.js"],
    features: [
      "Прогноз на 5 дней с почасовой детализацией",
      "Интерактивные графики температуры",
      "Геолокация для автоматического определения местоположения",
      "Уведомления о резких изменениях погоды",
    ],
    githubLink: "#",
    liveDemoLink: "#",
  },
  {
    id: 5,
    img: img1,
    title: "lorem5",
    category: "JS",
    description:
      "Полнофункциональная платформа для онлайн-продаж с корзиной, платежами и личным кабинетом",
    technologies: ["React", "Node.js", "MongoDB", "Chart.js"],
    features: [
      "Прогноз на 5 дней с почасовой детализацией",
      "Интерактивные графики температуры",
      "Геолокация для автоматического определения местоположения",
      "Уведомления о резких изменениях погоды",
    ],
    githubLink: "#",
    liveDemoLink: "#",
  },
  {
    id: 6,
    img: react3,
    title: "lorem6",
    category: "React",
    description:
      "Полнофункциональная платформа для онлайн-продаж с корзиной, платежами и личным кабинетом",
    technologies: ["React", "Node.js", "MongoDB", "Chart.js"],
    features: [
      "Прогноз на 5 дней с почасовой детализацией",
      "Интерактивные графики температуры",
      "Геолокация для автоматического определения местоположения",
      "Уведомления о резких изменениях погоды",
    ],
    githubLink: "#",
    liveDemoLink: "#",
  },
];
